remidavidkoster/Redako-BibiFirmware/STM32G431/Core/Src/main.cpp
#define ANGLE_PD_COMP_FACTOR 1.3333333333f



int8_t right;
int8_t backwards;


// -- Constants --
float accelerationTargetAlpha = 0.0004f;         // Filter smoothing factor
float accelerationFeedForwardGain = -80.0f;           // Feedforward gain


MotionCommand debugCMD = {
		.command = COMMAND_QUEUE_LEFT_SIDE,
		.bibiNumber = 0,
		.newPosition = 50,
		.maxSpeed = 10,
		.acceleration = 10,
};

uint8_t sendMessage;



#define BUFFER_SIZE 100

uint32_t intervalBuffer[BUFFER_SIZE];
uint32_t bufferIndex = 0;
uint32_t bufferCount = 0;  // Track how many valid values are stored

// Compute min, max, and mean
uint32_t min ;
uint32_t max ;
uint64_t sum ;
uint32_t mean;




// Main loop
int main(void) {

	// Reset of all peripherals, Initializes the Flash interface and the Systick.
	HAL_Init();

	// Configure the system clock
	SystemClock_Config();

	// Initialize all configured peripherals
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_TIM1_Init();
	MX_ADC1_Init();
	MX_USART2_UART_Init();
	MX_TIM2_Init();
	MX_ADC2_Init();
	MX_TIM6_Init();
	MX_SPI2_Init();
	MX_SPI1_Init();
	MX_SPI3_Init();
	MX_TIM4_Init();
	MX_TIM8_Init();


	// Start microsecond timer, overflows after 71 minutes.
	HAL_TIM_Base_Start(&htim2);


	// Initialize ADC stuff
	ADC_Init();

	// Initialize RGB Led stuff
	RGB_Init();




	// Charge power only, no button pressed
	while (!HAL_GPIO_ReadPin(BUT1_GPIO_Port, BUT1_Pin)){

		// Update global battery Voltage
		BAT_Update();

		// Display Battery on led
		BAT_VoltageToRGB(BAT.voltage);

		// Run charge management logic
		CHG_RunLogic();
	}

	// Keep itself on
	HAL_GPIO_WritePin(SELF_TURN_ON_GPIO_Port, SELF_TURN_ON_Pin, (GPIO_PinState)1);

	// Get Bibi ID
	BIBI_Number = BIBI_GetID();

	// Initialize IMU
	IMU_Init();

	// Config radio
	NRF_ConfigMotionControlled();

	// Setup magnetic encoder
	ENC_Setup();

	// Initialize and enable motor driver
	MOT_Init();
	MOT_Enable();

	// Wait until stable, get gyro offsets
	IMU_WaitForStableGetGyroOffsets();

	// Turn motor on
	MOT_SetPhaseVoltage(5.65f, _3PI_2);

	//	// Wait until stable again, get gyro offsets again
	//	waitForStableGetGyroOffsets();
	HAL_Delay(2000);

	// Update encoder position
	ENC_Update();

	// And save as zero
	MOT_ZeroElectricAngle = normalizeAngle((float)(POLE_PAIRS * ENC_LastAngleRad));

	// Turn motor off
	MOT_SetPhaseVoltage(0, MOT_ZeroElectricAngle);

	// Set electrical angle target to current position
	electricalAngleTarget = ENC_LastFullAngleRad * POLE_PAIRS;







	// Begin Madwick filter at 10000hz
	filter.begin(SAMPLE_FREQUENCY);

	// initialize variables to pace updates to correct rate
	microsPerReading = 1000000 / SAMPLE_FREQUENCY;
	microsPrevious = TIM2->CNT;

	// Turn white led off
	HAL_GPIO_WritePin(LED_NOFF_GPIO_Port, LED_NOFF_Pin, (GPIO_PinState)0);

	while (1)  {

		// If another loop is due
		if (TIM2->CNT - microsPrevious >= microsPerReading) {

			// Update global battery Voltage
			BAT_Update();

			// Display Battery on led
			BAT_VoltageToRGB(BAT.voltage);

			// Run charge management logic
			CHG_RunLogic();

			// Low battery shut down
			BAT_CheckLowShutdown();

			// Check button shutdown
			SYS_ButShutdown();

			// Get IMU data and update Madgwick filter
			MAD_Update();

			// Check if the led button is pressed
			RGB_CheckFadexButton();



			// If we still have queued movements, and there's currently none running
			if (queuedMovementCount && !movement.running){

				// If it's time for the next one
				if (TIM2->CNT > queuedMovements[0].startTime){

					// Start next queued movement
					startMovement(queuedMovements[0]);

					// Move queued movements down a row
					memmove(&queuedMovements[0], &queuedMovements[1], sizeof(struct MovementStep) * (MAX_QUE_LENGTH - 1));

					// Zero out the last element
					memset(&queuedMovements[MAX_QUE_LENGTH - 1], 0, sizeof(struct MovementStep));

					// Decrement queued movement counter
					queuedMovementCount--;
				}
			}

			// If we have to start a new movement
			if (movement.start){
				movement.start = 0;
				movement.startTimestamp = TIM2->CNT;
				movement.running = 1;


				// If this is our first move
				if (notYetMoved){

					// Turn on the PIDs, and set the zero position
					PID_WeightAngleWithMotorSpeed.on = 1;
					diaboloZeroPosition = diaboloPosition;
					diaboloPosition = 0;
					lastDiaboloPosition = 0;
					lastDiaboloSpeed = 0;
					notYetMoved = 0;
//				    kalman_init(&kf);
				}

				// Turn on speed PID
				PID_BibiSpeedWithWeightAngle.on = 1;

				// Set current position as offset. Works because we're working in absolute units now.
				movement.startOffset = diaboloPosition;

				// Check what direction we're going
				movement.direction = movement.newPosition > movement.startOffset ? 1 : -1;

				// Movement planning
				p.totalDistance = ABS(movement.newPosition - movement.startOffset);
				p.rampRatio = LIMIT(0.2f, movement.acceleration, 2.55f);
				p.maxSpeed = LIMIT(0.2f, movement.maxSpeed, 2.55f);

				// Flag so the movement loop doesn't funk things up in the first run
				firstMovementLoop = 1;

				// Calculate the motion profile from the distance, acceleration, and max speed we've set.
				distanceSpeedRampRatioToProfileTimes(p);
			}


			if (movement.running){
				float runTime = (TIM2->CNT - movement.startTimestamp) / 1000000.0f;

				// Calculate position and speed targets
				positionTarget = (movement.startOffset + movement.direction * quinticPositionProfile(runTime, p.rampTime, p.cruiseTime, p.maxSpeed));

				// Set the lastPositionTarget to the positionTarget the first time we get here. Otherwise we get strange feedforwards values
				if (firstMovementLoop){
					firstMovementLoop = 0;
					lastPositionTarget = positionTarget;
					lastSpeedTarget = 0;
					PID_BibiSpeedWithWeightAngle.target = 0;
				}
				speedTarget = (positionTarget - lastPositionTarget) * SAMPLE_FREQUENCY;
				lastPositionTarget = positionTarget;

				// If we've passed the runtime, stop 'movement' (the PIDs still try to hold the current position). End when stopped if there's another movement queued.
				//				if (runTime >= p.totalTime || (runTime > 1.0f && queuedMovementCount && (movement.direction == 1 ? diaboloSpeed > 0 : diaboloSpeed < 0))) {
				if (runTime >= p.totalTime - (queuedMovementCount ? 0.25f : 0)) {
					movement.running = 0;
				}
			}


			// Check radio
			if (NRF_DataReady()) {
				NRF_GetData(buffer);
				NRF_ReceiveInterval = TIM2->CNT - NRF_ReceiveTimestamp;
				NRF_ReceiveTimestamp = TIM2->CNT;



//				// Store new interval in circular buffer
//				intervalBuffer[bufferIndex] = NRF_ReceiveInterval;
//				bufferIndex = (bufferIndex + 1) % BUFFER_SIZE;
//
//				// Update count until buffer fills
//				if (bufferCount < BUFFER_SIZE) {
//				    bufferCount++;
//				}
//
//				// Compute min, max, and mean
//				min = intervalBuffer[0];
//				max = intervalBuffer[0];
//				sum = 0;
//
//				for (uint32_t i = 0; i < bufferCount; i++) {
//				    uint32_t val = intervalBuffer[i];
//				    if (val < min) min = val;
//				    if (val > max) max = val;
//				    sum += val;
//				}
//
//				mean = (uint32_t)(sum / bufferCount);
//
//







				// If the new command isn't the same as the last one
				if (memcmp(&lastCmd, buffer, sizeof(MotionCommand))){

					// Copy the buffer to the command data structure
					MotionCommand cmd;
					memcpy(&cmd, buffer, sizeof(MotionCommand));
					memcpy(&lastCmd, &cmd, sizeof(MotionCommand));

					// Switch byte orders so QLab values make sense
					cmd.bibiNumber = (cmd.bibiNumber << 8) | (cmd.bibiNumber >> 8);
					cmd.newPosition = (cmd.newPosition << 8) | (cmd.newPosition >> 8);

